{"config": [{"config": {"init": "uniform", "input_length": null, "bias": true, "border_mode": "same", "input_dim": null, "subsample_length": 1, "trainable": true, "name": "convolution1d_6", "nb_filter": 32, "batch_input_shape": [null, 2, 60], "activation": "relu", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "filter_length": 5, "b_regularizer": null, "input_dtype": "float32", "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"init": "uniform", "input_length": null, "bias": true, "border_mode": "same", "input_dim": null, "subsample_length": 1, "trainable": true, "name": "convolution1d_7", "nb_filter": 32, "filter_length": 3, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "name": "maxpooling1d_5", "pool_length": 2, "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_5", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "bias": true, "b_regularizer": null, "input_dim": null, "output_dim": 16, "trainable": true, "name": "dense_9", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "bias": true, "b_regularizer": null, "input_dim": null, "output_dim": 8, "trainable": true, "name": "dense_10", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "bias": true, "b_regularizer": null, "input_dim": null, "output_dim": 1, "trainable": true, "name": "dense_11", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "activation": "sigmoid", "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.0", "class_name": "Sequential"}