{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.3", "config": [{"class_name": "Reshape", "config": {"trainable": true, "batch_input_shape": [null, 60, 2], "dtype": "float32", "name": "reshape_1", "target_shape": [60, 2]}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "bias_regularizer": null, "trainable": true, "padding": "same", "name": "conv1d_1", "dilation_rate": [1], "kernel_size": [5], "kernel_regularizer": null, "strides": [1]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "name": "dropout_1"}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "bias_regularizer": null, "trainable": true, "padding": "same", "name": "conv1d_2", "dilation_rate": [1], "kernel_size": [5], "kernel_regularizer": null, "strides": [1]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "name": "dropout_2"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_size": [3], "padding": "valid", "strides": [3], "name": "max_pooling1d_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "units": 4, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "sigmoid", "units": 1, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null}}]}