{"backend": "tensorflow", "keras_version": "2.0.3", "config": [{"class_name": "Conv1D", "config": {"bias_regularizer": null, "strides": [1], "bias_constraint": null, "trainable": true, "kernel_constraint": null, "name": "conv1d_11", "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "activation": "relu", "filters": 64, "dilation_rate": [1], "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3], "batch_input_shape": [null, 60, 2]}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "padding": "valid", "trainable": true, "pool_size": [2], "name": "max_pooling1d_6"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_14"}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "strides": [1], "bias_constraint": null, "trainable": true, "kernel_constraint": null, "name": "conv1d_12", "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "relu", "filters": 64, "dilation_rate": [1], "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3]}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "padding": "valid", "trainable": true, "pool_size": [2], "name": "max_pooling1d_7"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_15"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "dense_11", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "sigmoid", "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "class_name": "Sequential"}