{"keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"name": "reshape_10", "target_shape": [60, 2], "trainable": true, "dtype": "float32", "batch_input_shape": [null, 60, 2]}}, {"class_name": "Conv1D", "config": {"trainable": true, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_size": [5], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv1d_58", "bias_constraint": null, "padding": "same", "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_51", "trainable": true, "rate": 0.2}}, {"class_name": "Conv1D", "config": {"trainable": true, "dilation_rate": [1], "activation": "relu", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_size": [5], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv1d_59", "bias_constraint": null, "padding": "same", "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_52", "trainable": true, "rate": 0.2}}, {"class_name": "MaxPooling1D", "config": {"strides": [3], "name": "max_pooling1d_35", "pool_size": [3], "trainable": true, "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_20", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_39", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_53", "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_40", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activation": "sigmoid"}}]}